---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipment
source: html/f1b3ed25-0009-9a78-03ab-1fa1ccc199cd.htm
---
# MechanicalEquipment Methods

Causes the object to release immediately any resources it may be utilizing.